{"claim": "Homeland is an American television spy thriller based on the Israeli television series Prisoners of War.", "question": "Who won the Best Directing for a Drama Series award for the original Israeli series that was adapted into the American series Homeland, which premiered in 2011?", "passage_A": "Homeland (stylized as HOMƎLAND) is an American espionage thriller television series developed by Howard Gordon and Alex Gansa. Based on the Israeli series Prisoners of War (Hebrew: חטופים, romanized: Hatufim, literally \"Abductees\"), it was created by Gideon Raff, who also serves as an executive producer on Homeland. The series stars Claire Danes as Carrie Mathison, a CIA officer with bipolar disorder, convinced that decorated Marine Corps scout sniper Nicholas Brody (Damian Lewis) was \"turned\" by al-Qaeda and poses a threat to the United States. The series storyline grows from that premise, together with Mathison's ongoing covert work. The series was broadcast in the United States on cable channel Showtime, and was produced by Fox 21 Television Studios (formerly Fox 21). It premiered on October 2, 2011. The first episode was made available online more than two weeks before the television broadcast, with viewers having to complete game tasks to gain access. The series' eighth and final season premiered on February 9, 2020. The finale aired on April 26, 2020. The series received largely positive reviews, with its first two seasons gaining near universal praise. It won several awards, including the 2011 and 2012 Golden Globe Award for Best Television Series – Drama for its first two seasons, and the 2012 Primetime Emmy Award for Outstanding Drama Series for its first season. Danes won the Primetime Emmy Award for Outstanding Lead Actress in a Drama Series twice (from five nominations), and Lewis won the Primetime Emmy Award for Outstanding Lead Actor", "passage_B": "acclaim and was awarded Best Drama Series of 2010 by the Israeli Academy of Film and Television. For their work on the show, Gideon Raff won Best Directing for a Drama Series, Ishai Golan won Best Actor in a Drama Series, and Yael Abecassis won Best Actress in a Drama Series. The series was not without controversy. It was criticized by family members of soldiers held prisoner, including Miriam Groff, mother of one of the men released in the Jibril Agreement. She suggested that the series might encourage the kidnapping of soldiers. Viewing figures for the second season of Hatufim were even higher than for the first, with an average audience share of 40% (rising to 47.9% for the final episode) making it the highest-rated drama in Israel in 2012. Online viewing reached 3 million. At the 2013 Seoul International Drama Awards, Hatufim (season 2) was awarded the festival's Grand Prize, out of a total of 225 entries from 48 countries. Other series nominated included Homeland (season 2) and House (season 8). At the 2013 Israeli Academy Television Awards, season 2 of Hatufim was nominated in 9 categories, including (for Drama Series) Best Series, Best Directing (Gideon Raff), Best Screenplay (Gideon Raff) and Best Actor (Assi Cohen). In December 2009, three months before Hatufim premiered in Israel, it was reported that the rights to develop an American version of the series had been sold to 20th Century Fox Television. It was sold on the strength of the script alone, before", "scores": {"requires_both_score": 5, "logical_dependency_score": 5, "hotpot_style_score": 5, "objectivity_score": 5}}
{"claim": "Lucas starred an actor that died on March 10.", "question": "What is the title of the film in which Corey Haim played a 14-year-old high school student alongside actors like Kerri Green and Charlie Sheen?", "passage_A": "Corey Ian Haim (December 23, 1971 – March 10, 2010) was a Canadian actor who rose to fame in the 1980s as a teen heartthrob. He starred in Silver Bullet (1985), Murphy's Romance (1985), Lucas (1986), License to Drive (1988) and Dream a Little Dream (1989). His role in The Lost Boys (1987) made him a household name. Known as The Two Coreys, Haim and Corey Feldman became 1980s icons and appeared together in seven films, later starring in the A&E American reality show The Two Coreys. Haim's early success led to money and fame. He had difficulty breaking away from the trauma of his experience as a child actor and struggled with substance abuse. He faced numerous challenges in his adult life, including financial difficulties and ongoing battles with addiction. He died of pneumonia on March 10, 2010. Early life Haim was born on December 23, 1971, in Toronto, Ontario, the son of Judy Haim, an Israeli-born data processor, and Bernie Haim, who worked in sales. In 1982, his parents divorced after 18 years of marriage. He had an older sister, Cari, and a younger half-brother, Daniel Lee, from his father's second marriage. Haim was Jewish; his Hebrew name was Yechezkel Yehudah. Haim was raised in Chomedey, Laval, Quebec (a suburb of Montreal), and, later, Willowdale, Toronto. There, his mother enrolled him in drama classes in improvisation and mime to help him overcome his shyness. Haim's skill as a hockey player led to his being scouted for the AA", "passage_B": "Lucas is a 1986 American coming-of-age romantic-sports film written and directed by David Seltzer in his directorial debut, and starring Corey Haim, Kerri Green, Charlie Sheen, and Courtney Thorne-Smith. Thorne-Smith and Winona Ryder made their film debuts in Lucas. Plot Lucas Blye is a 14-year-old high school student in suburban Chicago. He becomes acquainted with Maggie, an attractive older girl who has just moved to town, on one of his entomological quests. Becoming friends, Maggie spends time with him during the summer until school begins. Lucas, a frequent victim of bullying, has a protector of sorts in Cappie Roew, an older student and a football player. Cappie was one of Lucas' tormentors until he contracted hepatitis and Lucas brought him his homework every day, ensuring that Cappie did not have to repeat a year of school. Maggie becomes a cheerleader for the football team to get closer to Cappie, on whom she has a crush. Angered by her inattention towards him, Lucas chastises her, dismissing her cheerleading as \"superficial\" and incorrectly believing she will be his date to an upcoming school dance. On the night of the dance, Cappie is dumped by his girlfriend Alise due to his attraction to Maggie. Cappie finds comfort with Maggie at her house to the chagrin of Lucas, who arrives to pick her up for the dance. Even though Cappie and Maggie invite him out for pizza, he rebukes them and rides off on his bike. Rina, one of Lucas' friends, encounters him sitting", "scores": {"requires_both_score": 5, "logical_dependency_score": 5, "hotpot_style_score": 5, "objectivity_score": 5}}
{"claim": "John McCain works in politics.", "question": "Which committee did John McCain chair that has jurisdiction over military research and development?", "passage_A": "McCain also gained a reputation as a \"maverick\" for his willingness to break from his party on certain issues, including LGBT rights, gun regulations, and campaign finance reform where his stances were more moderate than those of the party's base. McCain was investigated and largely exonerated in a political influence scandal of the 1980s as one of the Keating Five; he then made regulating the financing of political campaigns one of his signature concerns, which eventually resulted in passage of the McCain–Feingold Act in 2002. He was also known for his work in the 1990s to restore diplomatic relations with Vietnam. McCain chaired the Senate Commerce Committee from 1997 to 2001 and 2003 to 2005, where he opposed pork barrel spending and earmarks. He belonged to the bipartisan \"Gang of 14\", which played a key role in alleviating a crisis over judicial nominations. McCain entered the race for the 2000 Republican presidential nomination, but lost a heated primary season contest to George W. Bush. He secured the 2008 Republican presidential nomination, beating fellow candidates Mitt Romney and Mike Huckabee, though he lost the general election to Barack Obama. McCain subsequently adopted more orthodox conservative stances and attitudes and largely opposed actions of the Obama administration, especially with regard to foreign policy matters. In 2015, he became Chairman of the Senate Armed Services Committee. He refused to support then-Republican presidential nominee Donald Trump in the 2016 presidential election and later became a vocal critic of the first Trump administration. While McCain", "passage_B": "The Committee on Armed Services, sometimes abbreviated SASC for Senate Armed Services Committee, is a committee of the United States Senate empowered with legislative oversight of the nation's military, including the Department of Defense, military research and development, nuclear energy (as pertaining to national security), benefits for members of the military, the Selective Service System, and other matters related to defense policy. The Armed Services Committee was created as a result of the Legislative Reorganization Act of 1946 following the U.S. victory in World War II. The bill merged the responsibilities of the Committee on Naval Affairs, established in 1816, and the Committee on Military Affairs, also established in 1816. Considered one of the most powerful Senate committees, its broad mandate allowed it to report some of the most extensive and revolutionary legislation during the Cold War years, including the National Security Act of 1947. The committee tends to take a more bipartisan approach than other committees, as many of its members formerly served in the military or have major defense interests located in the states they represent. The committee's regular legislative product is the National Defense Authorization Act (NDAA), which has been passed by Congress and signed into law annually since 1962. The current chair is Republican Roger Wicker of Mississippi, and the ranking member is Democrat Jack Reed of Rhode Island. Jurisdiction According to the Standing Rules of the United States Senate, all proposed legislation, messages, petitions, memorials, and other matters relating to the following subjects are referred", "scores": {"requires_both_score": 4, "logical_dependency_score": 5, "hotpot_style_score": 4, "objectivity_score": 5}}
